# ## Домашнее задание

# Длительность: 5 минут
# Формат: Объясняет преподаватель

# ❗ Обратите внимание студентов на то, что подробнее эта же задача будет обсуждаться в группах на следующем семинаре.

# ❗ Для тех, кто успеет выполнить задачу про калькулятор - домашнюю задачу можно начать разбирать на семинаре.

# **Задание в группах:** Создать телефонный справочник с возможностью импорта и экспорта данных в нескольких форматах. 

# - *под форматами понимаем структуру файлов, например:в файле на одной строке хранится одна часть записи, пустая строка - разделитель*
    
#     *Фамилия_1*
#     *Имя_1*
#     *Телефон_1*
#     *Описание_1*

#     *Фамилия_2*
#     *Имя_2*
#     *Телефон_2*
#     *Описание_2*

#     *и т.д.в файле на одной строке хранится все записи, символ разделитель - **;***
#     *Фамилия_1,Имя_1,Телефон_1,Описание_1*
#     *Фамилия_2,Имя_2,Телефон_2,Описание_2*
#     *и т.д.*

#     ❗ Можно явно указать на использование CSV
#     *Если группа сильная, можно предложить внедрить JSON, XML*
